app/Controllers/AdminController.php

SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE `role` = 'admin'
---
    public function dashboard()
    {
        $this->checkAdminAccess();

        try {
            // Get counts for dashboard statistics
            $count_admin = $this->db->table('users')->where('role', 'admin')->countAllResults();
            $count_teacher = $this->db->table('users')->where('role', 'teacher')->countAllResults();
            $count_student = $this->db->table('users')->where('role', 'student')->countAllResults();