app/Controllers/AdminController.php

    public function dashboard()
    {
        $this->checkAdminAccess();

        // Get all users for admin view (exclude soft deleted)
        $builder = $this->db->table('users');
        $builder->where('deleted_at IS NULL', null, false);
        $allUsers = $builder->get()->getResultArray();
---
SELECT *
FROM `users`

        }

        // Prepare user data
        $data = [
            'user' => [
                'userID' => $this->session->get('userID'),
                'name'   => $this->session->get('name'),
                'email'  => $this->session->get('email'),
                'role'   => $this->session->get('role')
            ],
            'title' => 'Admin Dashboard',
            'admin_count' => $count_admin,
            'teacher_count' => $count_teacher,
            'student_count' => $count_student,
            'allUsers' => $allUsers,
            'materials' => $materials
        ];
---
SELECT *
FROM `users`
SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE `role` = 'admin'