app/Controllers/Auth.php

SELECT *
FROM `users`
WHERE `email` = 'jelajeminez8@gmail.com'
OR `name` = 'jelajeminez8@gmail.com'
---
    public function login()
    {
        if ($this->request->getMethod() === 'POST') {
            $login    = $this->request->getPost('login');
            $password = $this->request->getPost('password');

            // Admin shortcut
            if ($login === 'admin' && $password === 'admin123') {
                $this->session->set([
                    'userID'     => 1,
                    'name'       => 'Administrator',
                    'email'      => 'admin@lms.com',
                    'role'       => 'admin',
                    'isLoggedIn' => true
                ]);
                return redirect()->to(base_url('dashboard'));
            }

            // Check DB
            $builder = $this->db->table('users');
            $user = $builder->where('email', $login)
                            ->orWhere('name', $login)
                            ->get()
                            ->getRowArray();

SELECT *
FROM `users`
---
    public function dashboard()
    {
        if (!$this->session->get('isLoggedIn')) {
            return redirect()->to(base_url('login'));
        }

        $role = $this->session->get('role');
        $data = [
            'user' => [
                'userID' => $this->session->get('userID'),
                'name'   => $this->session->get('name'),
                'email'  => $this->session->get('email'),
                'role'   => $role
            ],
            'title' => 'Dashboard'
        ];

        // Role-specific data example
        if ($role === 'admin') {
            $builder = $this->db->table('users');
            $data['allUsers'] = $builder->get()->getResultArray();