app/Controllers/Course.php

SELECT *
FROM `courses`
---
    public function index()
    {
        $db = \Config\Database::connect();
        $data['courses'] = $db->table('courses')->get()->getResult();