app/Controllers/Materials.php

SELECT COUNT(*) AS `numrows` FROM `materials`
SELECT SUM(`file_size`) AS `file_size`
FROM `materials`
SELECT *
FROM `materials`
---
    public function getDashboardStats()
    {
        $db = \Config\Database::connect();

        // Total materials
        $totalMaterials = $db->table('materials')->countAll();

        // Total size
        $sizeResult = $db->table('materials')
            ->selectSum('file_size')
            ->get()
            ->getRow();
        $totalSize = $sizeResult ? $sizeResult->file_size : 0;
        $totalSizeMB = round($totalSize / (1024 * 1024), 2);

        // Materials by type
        $materials = $db->table('materials')->get()->getResultArray();

SELECT COUNT(*) AS `numrows`
FROM `materials`
WHERE `created_at` >= '2025-10-18 17:11:54'
---
        }

        // Recent uploads (last 7 days)
        $recentUploads = $db->table('materials')
            ->where('created_at >=', date('Y-m-d H:i:s', strtotime('-7 days')))
            ->countAllResults();