app/Controllers/Notifications.php

SELECT COUNT(*) AS `numrows`
FROM `notifications`
WHERE `user_id` = '6'
AND `is_read` = 0
SELECT *
FROM `notifications`
WHERE `user_id` = '6'
ORDER BY `created_at` DESC
 LIMIT 10
---
    public function get(): ResponseInterface
    {
        // Check if user is logged in
        if (!session()->get('isLoggedIn')) {
            return $this->response->setJSON([
                'success' => false,
                'message' => 'User not authenticated'
            ])->setStatusCode(401);
        }

        // ✅ Use 'userID' to match the enrollment logic
        $userId = session()->get('userID');

        // Get unread count
        $unreadCount = $this->notificationModel
            ->where('user_id', $userId)
            ->where('is_read', 0)
            ->countAllResults();

        // Get recent notifications (last 10)
        $notifications = $this->notificationModel
            ->where('user_id', $userId)
            ->orderBy('created_at', 'DESC')
            ->limit(10)
            ->findAll();